/* An error occurred when creating a new album. Please check your internet connection and try again later. */
"An error occurred when creating a new album. Please check your internet connection and try again later." = "Si è verificato un errore durante la creazione di un nuovo album. Per favore controlla la tua connessione internet e riprova più tardi.";

/* An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later. */
"An error occurred when uploading an image to Picasa Web Albums. Please check your internet connection and try again later." = "Si è verificato un errore durante l’upload di un’immagine su Picasa Web Albums. Per favore controlla la tua connessione internet e riprova.";

/* Could not create a new album */
"Could not create a new album" = "Impossibile creare un nuovo album.";

/* Could not upload an image */
"Could not upload an image" = "Impossibile caricare un’immagine";
